Table of Contents
 Enum SupportType
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Types of support
[Flags]
public enum SupportType
Fields
Hinge = 2
Hinge type
HingeHinge = 2
Combination of hinge and hinge
HingeNoSupport = NoSupport | Hinge
Combination of hinge and nosupport
NoSupport = 1
Without support
Rigid = 4
Rigid type
RigidHinge = Hinge | Rigid
Combination of rigid and hinge
RigidNoSupport = NoSupport | Rigid
Combination of rigid and nosupport
RigidRigid = 4
Combination of rigid and rigid
Fields
 Name |  Description
 Hinge = 2
Hinge type
 HingeHinge = 2
Combination of hinge and hinge
 HingeNoSupport = NoSupport | Hinge
Combination of hinge and nosupport
 NoSupport = 1
Without support
 Rigid = 4
Rigid type
 RigidHinge = Hinge | Rigid
Combination of rigid and hinge
 RigidNoSupport = NoSupport | Rigid
Combination of rigid and nosupport
 RigidRigid = 4
Combination of rigid and rigid
 Edit this page